[Killed] MethodExpression
src/utils/sanitize.ts:86:17
 
 export const sanitizeEmailAddress = (raw: string | null | undefined): string => {
   if (!raw) return ""
-  const email = String(raw).trim()
+  const email = String(raw)
   return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email) ? email : ""
 }
killedBy: sanitize utilities sanitizeEmailAddress trims whitespace around valid email
statusReason: expected '' to be 'user@example.com' // Object.is equality

[Killed] Regex
src/utils/sanitize.ts:87:10
 export const sanitizeEmailAddress = (raw: string | null | undefined): string => {
   if (!raw) return ""
   const email = String(raw).trim()
-  return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email) ? email : ""
+  return /^[^\s@]+@[^\s@]+\.[^\s@]$/.test(email) ? email : ""
 }
 
killedBy: sanitize utilities sanitizeEmailAddress returns valid email as-is
statusReason: expected '' to be 'user@example.com' // Object.is equality

[Killed] Regex
src/utils/sanitize.ts:87:10
 export const sanitizeEmailAddress = (raw: string | null | undefined): string => {
   if (!raw) return ""
   const email = String(raw).trim()
-  return /^[^\s@]+@[^\s@]+\.[^\s@]+$/.test(email) ? email : ""
+  return /^[^\s@]@[^\s@]+\.[^\s@]+$/.test(email) ? email : ""
 }
 
killedBy: sanitize utilities sanitizeEmailAddress returns valid email as-is
statusReason: expected '' to be 'user@example.com' // Object.is equality

[Killed] ConditionalExpression
src/utils/sanitize.ts:91:7
 }
 
 export const sanitizeTelegramUrl = (raw: string | null | undefined): string => {
-  if (!raw) return ""
+  if (false) return ""
   const trimmed = String(raw).trim()
   if (!trimmed) return ""
killedBy: sanitize utilities sanitizeTelegramUrl returns empty string for undefined
statusReason: expected 'https://t.me/undefined' to be '' // Object.is equality

[Killed] BooleanLiteral
src/utils/sanitize.ts:91:7
 }
 
 export const sanitizeTelegramUrl = (raw: string | null | undefined): string => {
-  if (!raw) return ""
+  if (raw) return ""
   const trimmed = String(raw).trim()
   if (!trimmed) return ""
killedBy: sanitize utilities sanitizeTelegramUrl returns empty string for undefined
statusReason: expected 'https://t.me/undefined' to be '' // Object.is equality

[Killed] ConditionalExpression
src/utils/sanitize.ts:95:7
   const trimmed = String(raw).trim()
   if (!trimmed) return ""
 
-  if (trimmed.startsWith("http")) {
+  if (true) {
     const safe = sanitizeHttpUrl(trimmed)
     if (!safe) return ""
killedBy: sanitize utilities sanitizeTelegramUrl converts @username to https://t.me/username
statusReason: expected '' to be 'https://t.me/university' // Object.is equality

[Killed] ConditionalExpression
src/utils/sanitize.ts:95:7
   const trimmed = String(raw).trim()
   if (!trimmed) return ""
 
-  if (trimmed.startsWith("http")) {
+  if (false) {
     const safe = sanitizeHttpUrl(trimmed)
     if (!safe) return ""
killedBy: sanitize utilities sanitizeTelegramUrl accepts valid t.me URL
statusReason: expected '' to contain 't.me'

[Killed] BooleanLiteral
src/utils/sanitize.ts:110:7
   const withoutPrefix = trimmed.replace(/^@+/, "")
   // TD-14-06: Validate Telegram username format — [a-zA-Z0-9_]{5,32}
   // Rejects path-traversal attempts like "../../admin" or empty strings.
-  if (!/^[a-zA-Z0-9_]{5,32}$/.test(withoutPrefix)) return ""
+  if (/^[a-zA-Z0-9_]{5,32}$/.test(withoutPrefix)) return ""
   return `https://t.me/${withoutPrefix}`
 }
killedBy: sanitize utilities sanitizeTelegramUrl converts @username to https://t.me/username
statusReason: expected '' to be 'https://t.me/university' // Object.is equality

[Killed] ConditionalExpression
src/utils/sanitize.ts:110:7
   const withoutPrefix = trimmed.replace(/^@+/, "")
   // TD-14-06: Validate Telegram username format — [a-zA-Z0-9_]{5,32}
   // Rejects path-traversal attempts like "../../admin" or empty strings.
-  if (!/^[a-zA-Z0-9_]{5,32}$/.test(withoutPrefix)) return ""
+  if (false) return ""
   return `https://t.me/${withoutPrefix}`
 }
killedBy: sanitize utilities sanitizeTelegramUrl rejects short usernames (less than 5 chars)
statusReason: expected 'https://t.me/abc' to be '' // Object.is equality
